{
  "Home": "Home",
  "Speakers": "Speakers",
  "All Speakers": "All Speakers",
  "Registration": "Registration",
  "Submit": "Call for Paper",
  "About": "About",
  "Contact": "Contact",
  "Back": "Back",
  "Details": "Details",
  "Workshop and Sub-symposium Sessions": "Workshop and Parallel Sessions",
  "Session": "Parallel Session",
  "Host": {
    "Name": "Organizer",
    "Language": "Language",
    "Date": "Dates",
    "Location": "Location",
    "Details": {
      "Name": "Harvard China Education Symposium, The Education University of Hong Kong",
      "Language": "Chinese and English",
      "Date": "8 to1o May,2025",
      "Location": "The Education University of Hong Kong, the picturesque Tai Po Campus"
    }
  },
  "Cover Image": "/img/poster/cover_en.jpg",
  "Collapse": "Collapse",
  "Show More": "Show More",
  "PopWindow": {
    "Title": "Submission Link",
    "Content": "Please click here to submit your paper"
  },
  "Invite Speakers": "Invite Speakers",
  "Guest of Honor": "Guest of Honor",
  "Keynote Speakers": "Keynote Speakers",
  "Track Workshop Chair": "Track Workshop Chair",
  "Organizing Committee": "Organizing Committee",
  "Media": {
    "Title": "Connect With Us",
    "Redbook": {
      "Name": "Red",
      "Intro": "Follow us on Xiaohongshu",
      "Details": "哈佛CES 香港教大聯合論壇"
    },
    "Wechat": {
      "Name": "WeChat",
      "Intro": "Public Channel on WeChat",
      "Details": "Harvard CES-EdUHK"
    },
    "Email": {
      "Name": " ",
      "Details": "Inquiries: {0}"
    }
  },
  "Disclaimer": "<span class=\"text-start\"><strong><i>Disclaimer:</i></strong></span><i>The ideas and opinions expressed in this  symposium are those of the speakers;</i><br><span class=\"ml-20\"><i>they are not necessarily those of UNESCO and do not commit the Organization.</i></span>",
  "Symposium": {
    "Title": "Introduction",
    "Click": "Click About for more details",
    "Title Long": "Joint Symposium on Emerging Technologies and Future Talent\n\nBy Harvard CES and EdUHK",
    "Intro": "The Joint Symposium on Emerging Technologies and Future Talent, collaboratively organized by The China Education Symposium at Harvard University (CES) and the Global Institute for Emerging Technologies (GIET) at the Education University of Hong Kong (EdUHK), will be a three-day event from May 8-10, 2025. It will delve into the integration of new technologies such as AI, the Metaverse, and Intelligent Reality within teaching, training, and talent development.\n\nThe Symposium will feature diverse sessions, including workshops on developing AI tools and ethical AI practices, as well as keynote addresses and panel discussions that highlight AI-driven personalized learning, instructional design, and the cultivation of creativity and futuristic thinking. Participants will explore a wide range of topics through parallel sessions focusing on AI, the Metaverse, computing education, research analytics, education futures, and talent development.",
    "Details": "The Joint Symposium on Emerging Technologies and Future Talent, collaboratively organized by The China Education Symposium at Harvard University (CES) and the Global Institute for Emerging Technologies (GIET) at the Education University of Hong Kong (EdUHK), will be a three-day event from May 8-10, 2025. It will delve into the integration of new technologies such as AI, the Metaverse, and Intelligent Reality within teaching, training, and talent development.\n\nThe Symposium will feature diverse sessions, including workshops on developing AI tools and ethical AI practices, as well as keynote addresses and panel discussions that highlight AI-driven personalized learning, instructional design, and the cultivation of creativity and futuristic thinking. Participants will explore a wide range of topics through parallel sessions focusing on AI, the Metaverse, computing education, research analytics, education futures, and talent development.\n\nThe China Education Symposium, initiated by the Harvard Graduate School of Education in 2010, fosters meaningful dialogue and collaboration among educators, scholars, policymakers, and leaders from China and the United States. EdUHK has become the largest tertiary institution specialized in teacher education in Hong Kong and is recognized internationally for its leadership in education. It is ranked 6th globally in Education and Educational Research in the 2024-2025 U.S. News & World Report’s Best Global Universities Rankings. The 16th China Education Symposium in 2025, besides being held at Harvard, will also collaborate with EdUHK to create a groundbreaking event known as the Joint Symposium on Emerging Technologies and Future Talent. Knowledge knows no bounds! This is a trail-blazing attempt to enhance cooperation between prestigious Chinese and American universities and leading industries in technology and talent development, so as to expand the influence of this iconic symposium of Harvard’s Graduate School of Education to Asia.\n\nSupported by President John Chi Kin Lee of EdUHK and The CES, the Symposium boasts an impressive roster of speakers from globally recognized institutions such as Harvard, Stanford, Cambridge, University of Toronto, and Peking University. It also features technology and education policymakers and experts from Mainland China and Hong Kong SAR to deliver keynote and plenary speeches. We are honored to welcome Presidents from prestigious universities and professors from the Harvard Graduate School of Education and the Education University of Hong Kong to deliver keynote speeches. Each speaker will contribute a rich blend of current insights and research advancements in emerging technologies, education, and talent cultivation. The CES team of Harvard will also conduct a thematic workshop and interact with students and staff from EdUHK and beyond before or after the Symposium.\n\nThis joint Symposium will not only be a feast of knowledge, but also a collision of sparks where diverse thoughts converge across different times and spaces!"
  },
  "Organised by": "Organised by:",
  "In collaboration with": "In collaboration with:",
  "Organisers and Partners": "Organisers and Partners",
  "Symposium Introduction": "Symposium Introduction",
  "Symposium Location": "Symposium Location",
  "Symposium Time": "Symposium Agenda",
  "Symposium Agenda": "img/poster/Agenda-en.png",
  "Harvard China Education Symposium": "Harvard China Education Symposium",
  "The Education University of Hong Kong": "The Education University of Hong Kong",
  "Workshop": "Workshop",
  "Poster": "Poster",
  "Track": "Track",
  "Sub-symposium Sessions Submit": "Parallel Sessions Submission",
  "Harvard": "Harvard CES, Graduate School of Education, Harvard University",
  "GIET": "President's Office and Global Institute for Emerging Technologies (GIET), The Education University of Hong Kong",
  "About Us": {
    "EduHK": {
      "intro title": "About EdUHK",
      "intro": "The Education University of Hong Kong is a publicly funded tertiary institution dedicated to the advancement of learning and teaching, through a diverse offering of academic and research programmes on teacher education and complementary social sciences and humanities disciplines.\n\nWe nurture educators and social leaders who are intellectually active, socially caring, and globally aware, to become agents of change in the communities that they serve. We place great emphasis on research capability — our research will contribute to the advancement of knowledge, scholarship and innovation, with sustainable impact on social progress and human betterment.\n\nEdUHK aims to be a leading university in the Asia Pacific region and beyond, with a focus on educational research, development and innovation.",
      "vision title": "Our Vision",
      "vision": "We will further enhance our role as a leading university in the Asia Pacific region and beyond, with a focus on educational research, development and innovation. We will continue to raise our profile and impact locally, regionally and internationally through our high quality research and scholarship. We are committed to nurturing outstanding and caring educators and professionals who contribute constructively to sustainable social and economic development in Hong Kong and beyond.",
      "mission title": "Our Mission",
      "mission": "Committed to the Education-plus approach, our primary mission is to lead educational innovation, and to promote and support the strategic development of teaching, teacher education and disciplines complementary to education by preparing outstanding and morally responsible educators and professionals while supporting their lifelong learning.",
      "president title": "President’s Welcome",
      "president": "I am pleased that we have created a multidisciplinary environment conducive to the pursuit of knowledge. This goes hand in hand with our increasingly diversified academic profile, as well as our research and knowledge transfer initiatives. This also helps establish a community of engaged learners and eminent academics, who thrive in a vibrant scholarly environment.\n\nAt EdUHK, we are committed to nurturing outstanding educators and professionals, who are passionate, professional, ethical and innovative. Building upon our academic strengths in teacher education, we have been expanding the scope of our undergraduate and postgraduate programmes to encompass artificial intelligence and educational technology, heritage education and arts management, sports science and coaching, and global and regional studies.\n\nAs a research-active university, we have made great strides in research in education and various emerging disciplines, such as environmental management, psychology, linguistics and language studies, with the University Grants Committee recognising our research output as “World Leading” and “Internationally Excellent” in its latest Research Assessment Exercise. The numerous prestigious accolades earned are also testimony to our contribution to the convergence of knowledge, technology and society.\n\nTo better synergise our interdisciplinary expertise, I am pleased to witness the establishment of two new Academies, namely the Academy for Educational Development and Innovation (AEDI), and the Academy for Applied Policy Studies and Education Futures (AAPSEF). They will serve as hubs of excellence to further extend our research impact in Hong Kong and beyond.\n\nI hope you enjoy exploring the learning and research opportunities offered by EdUHK.\n\nProfessor John Lee Chi-Kin, JP\n\nPresident and Chair Professor of Curriculum and Instruction",
      "link": "Learn More"
    },
    "HarvardCES": {
      "Intro": "Introduction to Harvard CES",
      "link": "👆 Link to the official Harvard CES website"
    }
  },
  "pSession": {
    "sub-symposium": "Parallel Session: Presentation Session",
    "poster": " Poster and Showcase Session"
  },
  "server": {
    "Organizing Committee": {
      "id1": {
        "description": "Professor Chi-Kin John Lee is a distinguished academic and leader in education, currently serving as President and Chair Professor at The Education University of Hong Kong. His career is marked by significant contributions to curriculum and instruction, including roles as Vice President (Academic) and Provost. Former Dean of Education and a recipient of the Vice-Chancellor’s Exemplary Teaching Award at The Chinese University of Hong Kong (CUHK), Professor Lee has an extensive research background with a focus on various educational areas. He is a top-cited scientist and has secured numerous grants for his projects. Professor Lee is an active member of several editorial boards, has authored and co-edited over 25 books, and has been involved in education and social services locally, nationally and globally. His projects have won awards, and he has held various prestigious positions, including Changjiang Scholar Chair Professor, UNESCO Chair and membership in the Chinese People’s Political Consultative Conference.",
        "name": "Professor John Chi-Kin Lee",
        "title": "President, Chair Professor of Curriculum and Instruction, The Education University of Hong Kong, UNESCO Chair"
      },
      "id2": {
        "description": "Dr. Minjuan Wang is a newly appointed Chair Professor of Emerging and Technologies and Future Education at the Education University of Hong Kong, Co-Director of the Global Institute for Emerging Technologies, and Editor-in-Chief of the IEEE Transactions on Learning Technologies (TLT). Her research specialties are multidisciplinary, focusing on STEM Education, Future Education enabled by new and emerging technologies, Metaverse and immersive learning, and the design and implementation of artificial intelligence including AIGC for teaching, learning and training. Professor Wang is a high-impact author and an internationally recognized scholar who has keynoted more than 45 conferences. She publishes extensively in indexed and high-impact English journals such as Nature-HSSC, Computers and Education, IEEE-TLT, and British Journal of Education Technology. In addition, her teaching and research were also featured in top core journals in China (e.g., Educational Research). As a senior member of the IEEE Education Society, she has contributed significantly to both the IEEE community and other scholarly circles. Her international reputation in the field is evident, reflected in her recent nomination as an iLRN scholar by Chris Dede from Harvard University. ",
        "name": "Professor Minjuan Wang",
        "title": "The Education University of Hong Kong, Senior Member, IEEE; EiC, IEEE Transactions on Learning Technologies (IEEE-TLT)"
      },
      "id3": {
        "description": "Elementary Music and Chinese Support Intervention teacher at a Chinese-English bilingual school in Massachusetts, a member of the board of directors of the New England branch of the Orff-Schulwerk Association (AOSA) in the United States, co-chairman of the International Clarinet Association (ICA) Development and Membership Committee and editor, Massachusetts State University Women f Or UMass (WFUM) Alumni Exchange Platform Publicity Director. The head of the music teaching and research team of the teaching support project of Beijing Childhood One Course Student Aid Development Center (TNYK).",
        "name": "Miss. Rongbing Shen",
        "title": "Secretary General of Harvard China Education Symposium (CES)"
      },
      "id4": {
        "description": "Anny Chan holds a Master’s in Education in Educational Leadership, Organization, and Entrepreneurship from Harvard University and is a faculty member at the Harvard Graduate School of Education. She researches the impact of artificial intelligence on teaching and learning, focusing on advancing equity and diversity through technology in education.\n\nAnny is the Chair of the 15th Harvard China Education Symposium and the founder of the Harvard Graduate School of Education’s Cross-Cultural Education Association and the International STEAM Network. She earned dual degrees in Business and Law from the University of Sydney and brings over a decade of experience across finance,education, and technology sectors in the U.S., U.K., Australia, France, Japan, China, and Hong Kong. Additionally, Anny founded the Global China Entrepreneur Network, mentoring over 500 international students. She is committed to fostering international exchange and interdisciplinary collaboration in education.",
        "name": "Miss. Anny Chan",
        "title": "Teaching Fellow, Harvard University (CES Board of Advisor)"
      },
      "id5": {
        "description": "Xuefan Li, CEO of National e-School and City High School in Canada, is a PhD candidate at the Ontario Institute for Studies in Education at the University of Toronto. His research focuses on prompt engineering in education, immersive educational technologies, educational economics, and online education. He has demonstrated exceptional research capabilities, leading and contributing to several significant projects, including studies on international student policies during COVID-19, student loans and future returns, and developing an LSTM model for predicting education stock markets. His work has been featured at top conferences like the Tsinghua Education Forum, Fudan International Education Research Forum and the Asian Conference on Education (ACE). He also serves as a panel director at the Harvard Chinese Education Symposium.",
        "name": "Dr. Xuefan Li",
        "title": "Ontario Institute for Studies in Education, University of Toronto, CEO of National e-School and City High School in Canada"
      }
    },
    "Keynote Speakers": {
      "id1": {
        "description": "Professor Chi-Kin John Lee is a distinguished academic and leader in education, currently serving as President and Chair Professor at The Education University of Hong Kong. His career is marked by significant contributions to curriculum and instruction, including roles as Vice President (Academic) and Provost. Former Dean of Education and a recipient of the Vice-Chancellor’s Exemplary Teaching Award at The Chinese University of Hong Kong (CUHK), Professor Lee has an extensive research background with a focus on various educational areas. He is a top-cited scientist and has secured numerous grants for his projects. Professor Lee is an active member of several editorial boards, has authored and co-edited over 25 books, and has been involved in education and social services locally, nationally and globally. His projects have won awards, and he has held various prestigious positions, including Changjiang Scholar Chair Professor, UNESCO Chair and membership in the Chinese People’s Political Consultative Conference.",
        "name": "Professor John Chi-Kin Lee",
        "title": "President, Chair Professor of Curriculum and Instruction, The Education University of Hong Kong, UNESCO Chair"
      },
      "id2": {
        "description": "",
        "name": "Professor Youqun Ren",
        "title": "Secretary of the CPC shandong University Committee, Doctor of Education, Professor, Vice President of the Chinese Society of Education, Deputy Director of the National Graduate Education Steering Committee for Professional Education "
      },
      "id3": {
        "description": "Prior to becoming a Senior Research Fellow, for 22 years Chris Dede was the Timothy E. Wirth Professor in Learning Technologies. His fundamental interest is developing new types of educational systems to meet the opportunities and challenges of the 21st century. His research spans emerging technologies for learning, infusing technology into large-scale educational improvement initiatives, developing policies that support educational transformation, and providing leadership in educational innovation. Currently, Dede is a co-principal investigator of the NSF-funded National Artificial Intelligence Institute in Adult Learning and Online Education. He co-founded the Silver Lining for Learning initiative and developed a widely used Framework for scaling up educational innovations.",
        "name": "Dr. Chris Dede",
        "title": "Distinguished Professor and Senior Research Fellow, Harvard University"
      },
      "id4": {
        "description": "Dr. Shijin Wang is currently the Executive Dean of the iFlytek Research Institute, Deputy Director of the National Key Laboratory of Cognitive Intelligence, and a part-time professor and doctoral advisor at the University of Science and Technology of China. His main research areas include signal processing, large models, and industry intelligence. He has received numerous awards, including the National Science and Technology Progress Award (First Class), the Provincial Science and Technology Award (First Class), the Wu Wenjun Artificial Intelligence Science and Technology Progress Award (First Class), the China Youth May Fourth Medal (collective), and the China Association for Science and Technology’s Qiu Shi Outstanding Youth Achievement Transformation Award. He has led his team to win several international competitions such as SQuAD, GLUE, and VCR. Dr. Wang spearheaded the “iFlytek Xinghuo Large Model Technology and Application” project, releasing the leading Xinghuo large model in China and continuously empowering multiple industry applications.",
        "name": "Dr. Shijin Wang",
        "title": "Vice CEO of iFlytek, Inc, Deputy Director of the State Key Laboratory of Cognitive Intelligence, P.R.China"
      },
      "id5": {
        "description": "Dr. Minjuan Wang is a newly appointed Chair Professor of Emerging and Technologies and Future Education at the Education University of Hong Kong, Co-Director of the Global Institute for Emerging Technologies, and Editor-in-Chief of the IEEE Transactions on Learning Technologies (TLT). Her research specialties are multidisciplinary, focusing on STEM Education, Future Education enabled by new and emerging technologies, Metaverse and immersive learning, and the design and implementation of artificial intelligence including AIGC for teaching, learning and training. Professor Wang is a high-impact author and an internationally recognized scholar who has keynoted more than 45 conferences. She publishes extensively in indexed and high-impact English journals such as Nature-HSSC, Computers and Education, IEEE-TLT, and British Journal of Education Technology. In addition, her teaching and research were also featured in top core journals in China (e.g., Educational Research). As a senior member of the IEEE Education Society, she has contributed significantly to both the IEEE community and other scholarly circles. Her international reputation in the field is evident, reflected in her recent nomination as an iLRN scholar by Chris Dede from Harvard University. ",
        "name": "Professor Minjuan Wang",
        "title": "The Education University of Hong Kong, Senior Member, IEEE; EiC, IEEE Transactions on Learning Technologies (IEEE-TLT)"
      },
      "id6": {
        "description": "Yew-Soon Ong is currently President's Chair Professor of Computer Science at the School of Computer Science and Engineering at Nanyang Technological University (NTU), Singapore. At the same time, he is Chief Artificial Intelligence (CAS) Scientist of the Singapore's Agency for Science, Technology and Research (A*STAR). At NTU, he presently serves as co-Director of the Singtel-NTU Cognitive &#38; Artificial Intelligence Joint Lab (SCALE&#64;NTU). He was Chair of the School of Computer Science and Engineering (SCSE), Nanyang Technological University from 2016-2018, Director of the Data Science and Artificial Intelligence Research Center (DSAIR) from 2016-2022, Director of the Centre for Computational Intelligence from 2008-2015 and Programme Principal Investigator of the Data Analytics &#38; Complex System Programme Rolls-Royce&#64;NTU Corporate Lab from 2013-2017.",
        "name": "Dr. Yew-Soon Ong",
        "title": "President's Chair Professor of Computer Science BEng MEng PhD, FIEEE, Nanyang Technological University (NTU), Singapore"
      },
      "id7": {
        "description": "Paul Kim (born 1970) is currently a Korean-American Chief Technology Officer and Associate Dean at the Stanford Graduate School of Education and has held this position since 2001. While at Stanford, in addition to teaching graduate level courses in the School of Education, he has been leading projects involving the design of learning technologies, educational research, and community development. Kim leads initiatives involving the design of learning technologies, educational research, and community development. Kim is also working with numerous international organizations to develop mobile empowerment solutions for extremely underserved communities in developing countries. In his recent expeditions to Latin America, Africa, and India, he investigated the effects of highly programmable open-source mobile learning platforms on education programs for literacy, numeracy, and entrepreneurship (e.g., math games, storytelling, and farming simulations)",
        "name": "Paul Kim",
        "title": "Stanford, Entrepreneur, Former CTO and Associate Dean at the Stanford Graduate School of Education"
      },
      "id8": {
        "description": "Dr. Jonathon Richter is focused on creating inclusive and meaningful communities for the emerging field of design, research, and applied understanding of immersive learning experiences to amplify its transformational potential for everyone and our planet. Born and raised in Havre, Montana, Jonathon Richter holds a Bachelor of Arts (B.A.) degree in Psychology (1992), Masters of Education (M.Ed.) degree (1998), and a Doctorate of Education (Ed.D.) degree (2003), each from the University of Montana. Following college, he returned to Havre to start his family and his career as a successful grant writer and project coordinator of educational technology, then later as Assistant Professor of Graduate Education Programs working for Montana State University – Northern in Havre, Montana (2000 – 2005).",
        "name": "Dr. Jonathon Ritcher",
        "title": " CEO of the Immersive Learning Research Network (iLRN), University of Montana "
      },
      "id9": {
        "description": "Dr. Tina Grotzer is a distinguished research scientist and educator with a focus on the learning and cognitive sciences. She has dedicated over three decades to applying cognitive science in various educational contexts, teaching on sustainability, complexity, and climate change. Grotzer is known for her work on fostering expert learners and promoting adaptive expertise to prepare students for future challenges. As the faculty director of the Next Level Lab, she explores future work environments and optimal learning. Her earlier roles include being a principal investigator on projects that advanced causal learning in education and understanding of ecosystems through immersive technology, supported by the NSF and IES. Among her accolades are an NSF Career Award, a PECASE award, and the Morningstar Teaching Award. Grotzer has authored numerous research publications, books, and curricula, and collaborated on educational television with major networks. Her pre-Harvard career includes over a decade as an administrator and teacher.",
        "name": "Dr. Tina Grotzer",
        "title": "Principal Research Scientist in Education, Faculty Director, Harvard Graduate School of Education"
      }
    },
    "Guest of Honor": {
      "id1": {
        "description": "Anny Chan holds a Master’s in Education in Educational Leadership, Organization, and Entrepreneurship from Harvard University and is a faculty member at the Harvard Graduate School of Education. She researches the impact of artificial intelligence on teaching and learning, focusing on advancing equity and diversity through technology in education.\n\nAnny is the Chair of the 15th Harvard China Education Symposium and the founder of the Harvard Graduate School of Education’s Cross-Cultural Education Association and the International STEAM Network. She earned dual degrees in Business and Law from the University of Sydney and brings over a decade of experience across finance, education, and technology sectors in the U.S., U.K., Australia, France, Japan, China, and Hong Kong. Additionally, Anny founded the Global China Entrepreneur Network, mentoring over 500 international students. She is committed to fostering international exchange and interdisciplinary collaboration in education.",
        "name": "Miss. Anny Chan",
        "title": "Teaching Fellow, Harvard University; Board Member, Harvard China Education Symposium(CES)\n\nDirector of External Affairs, Joint Symposium on Emerging Technologies and Future Talent 2025"
      },
      "id2": {
        "description": "Professor May Cheng May-hung is currently Vice President (Academic) and Chair Professor of Teacher Education of The Education University of Hong Kong (EdUHK).\n\nProfessor Cheng began her teacher education work at the Sir Robert Black College of Education in 1990. As a long-serving member of EdUHK and the former Hong Kong Institute of Education, she has taken up academic leadership positions at different stages, such as Associate Vice President (Academic Affairs), Registrar, Acting Dean of the Faculty of Arts and Sciences, Associate Dean (Programmes), and Programme Director. Between 2010 and the end of 2011, Professor Cheng was a Reader in Professional Education in the Department of Education at the University of Oxford, and a fellow of the Governing Body at Kellogg College.\n\nProfessor Cheng graduated from The University of Hong Kong with a BSc (First-class Honours) degree, a Certificate in Education (Distinction) and a Master’s in Education. She obtained a PhD at the University of Waikato, New Zealand. She served as President of the East Asian Association for Science Education (EASE) from 2016 to 2019. Professor Cheng has actively participated in and made contributions to the international teacher education and science education arena.\n\nShe has been an International Committee member of the National Association for Research in Science Teaching in the US, and has chartered status as a fellow of the Royal Society of Biology in the UK. She is on the editorial boards of various international journals, such as Cogent Education, Teaching and Teacher Education, Teachers and Teaching, and Asia Pacific Journal of Teacher Education. She has obtained various research and project grants from the General Research Fund, the Quality Education Fund and the Education Bureau. She is also a prolific writer, having edited and written more than 13 books and published over 140 journal articles and book chapters.",
        "name": "Professor May Hung Cheng",
        "title": "Vice President (Academic); Chair Professor of Teacher Education\n\nGuest of Honor"
      },
      "id3": {
        "description": "Professor Chetwyn Chan is Vice President (Research and Development) and Peter T. C. Lee Chair Professor of Psychology. He obtained a PhD in educational psychology in 1995 from the University of Alberta, Canada. Professor Chan has been an Elected Fellow of the American Psychological Association since 2008 and a Fellow of the Hong Kong Psychological Society since 2007.\n\nIn 2008, in recognition of his contribution to psychology and rehabilitation sciences, Professor Chan received the Global Leadership in Rehabilitation Science Award from Virginia Commonwealth University in the United States. In 2011, he received the Alumni Honour Award from the University of Alberta in recognition of his influence in research and education development in rehabilitation in Asia. In 2018, Professor Chan and his research team won the First Prize in Science and Technology from the Chinese Association of Rehabilitation Medicine on post-stroke cognitive assessment and intervention innovation. In 2019, his research team won the Second Class State Scientific and Technology Progress Award from the State Council of the People’s Republic of China for integrating Chinese medicine into innovative post-stroke rehabilitation.\n\nProfessor Chan’s research work focuses on exploring mechanisms underlying human learning, particularly perceptual and cross-modal learning employing brain imaging, electroencephalograms, and behavioural methods. He also applies the mechanisms to understand the behaviours of people with disabilities and older individuals, and design interventions to enhance the functional capabilities of these individuals. He has published more than 200 research papers and secured more than $20 million in competitive research and development grants. Professor Chan is the chief specialty editor of Frontiers in Rehabilitation Science and an associate editor of Journal of Sports and Health Science.",
        "name": "Prof. Che Hin Chetwyn Chan",
        "title": "Vice President (Research and Development); Peter T. C. Lee Chair Professor of Psychology\n\nGuest of Honor"
      }
    },
    "Poster": {
      "id0": "./assets/poster/sub1-en.pdf",
      "id1": "./assets/poster/sub2-zh.pdf"
    }
  }
}